#include <stdio.h>
int main (void){
    int c = 3;//宣告整數c，把3賦值給C
    int i, j = 0;//宣告整數i跟j，且j = 0
    int a = 3;
    c *= 2 + 1;//後方的2+1優先於*=(乘完賦值給C) ，所以是3 X (2+1) = 9
    printf("%d\n", c);// 列印c的值
    c = ++c; //遞增，c會加1
    printf("%d\n", c);
    c = --c; //遞減，c會減1
    printf("%d\n", c);
    c += 2; //+= c加某數，然後再賦值給c
    printf("%d\n", c);
    c -= 2; // -= c減某數，然後再賦值給c
    printf("%d\n", c);
    c *= 2; // *= c乘某數，然後再賦值給c
    printf("%d\n", c);
    c /= 2; // /= c除以某數，然後再賦值給c
    printf("%d\n", c);
    i = ++j + 1; //++在前面是前置，代表先+1再進行其他操作
    /* 上面那一行等於 j = j + 1， i = j + 1  */
    printf("%d,%d\n", i ,j);//列印 i 跟j 的值
    a = a++ + a * 2;//++放後面是後置，先取得變數當前值，然後再加1，下一次變數才會改變
    /* 上面那一行等於a = 3 + 4*2  a為11*/
    printf("%d\n",a);
    /*運算子的優先順序
     * 高
     * (),++(後置),--(後置)，優先順序相同時，會先算左邊，再算右邊
     * +(表正號),-(表減號),++(前置),--(前置)，優先順序相同時，會先算右邊，再算左邊
     * *(乘),/(除),%(取餘數)，從左到右
     * +(加),-(減)，從左到右
     * =(指派),+=,-=,*=,/=,%=，從右到左
     * 低
     */

    return 0;
}